import { type CarouselItem } from "@types";

export const carouselItems: CarouselItem[] = [
  {
    image: "carousel-item-0.webp",
    description:
      "Каждая поверхность — это холст, на котором рождается стиль и настроение вашего интерьера. Мы тщательно подбираем материалы и технологии, чтобы стены не просто выглядели безупречно, но и создавали ощущение тепла, уюта и гармонии.",
  },
  {
    image: "carousel-item-1.webp",
    description:
      "Каждая деталь — от плитки до сантехники — продумана так, чтобы дарить ощущение чистоты и спокойствия. Мы создаём интерьеры, в которых функциональность гармонично сочетается с эстетикой, превращая санузел в настоящий оазис уюта и свежести.",
  },
  {
    image: "carousel-item-2.webp",
    description:
      "Каждый предмет создаёт атмосферу и задаёт ритм жизни в доме. Мы выбираем и создаём мебель с любовью к деталям, сочетая комфорт, функциональность и стиль. Правильная мебель — это не просто вещи, а элементы, которые делают пространство живым и удобным.",
  },
  {
    image: "carousel-item-3.webp",
    description:
      "Каждая штрих — это лёгкое прикосновение, словно ракушка, найденная на берегу, которая оживляет пространство и придаёт ему особое настроение. Тонкие штрихи создают уют, и в окружении таких мелочей ваш дом становится местом, куда хочется возвращаться снова и снова.",
  },
  {
    image: "carousel-item-4.webp",
    description:
      "Каждая поверхность — это холст, на котором рождается стиль и настроение вашего интерьера. Мы тщательно подбираем материалы и технологии, чтобы стены не просто выглядели безупречно, но и создавали ощущение тепла, уюта и гармонии.",
  },
  {
    image: "carousel-item-5.webp",
    description:
      "Каждая деталь — от плитки до сантехники — продумана так, чтобы дарить ощущение чистоты и спокойствия. Мы создаём интерьеры, в которых функциональность гармонично сочетается с эстетикой, превращая санузел в настоящий оазис уюта и свежести.",
  },
  {
    image: "carousel-item-6.webp",
    description:
      "Каждый предмет создаёт атмосферу и задаёт ритм жизни в доме. Мы выбираем и создаём мебель с любовью к деталям, сочетая комфорт, функциональность и стиль. Правильная мебель — это не просто вещи, а элементы, которые делают пространство живым и удобным.",
  },
  {
    image: "carousel-item-7.webp",
    description:
      "Каждая штрих — это лёгкое прикосновение, словно ракушка, найденная на берегу, которая оживляет пространство и придаёт ему особое настроение. Тонкие штрихи создают уют, и в окружении таких мелочей ваш дом становится местом, куда хочется возвращаться снова и снова.",
  },
  {
    image: "carousel-item-8.webp",
    description:
      "Каждая поверхность — это холст, на котором рождается стиль и настроение вашего интерьера. Мы тщательно подбираем материалы и технологии, чтобы стены не просто выглядели безупречно, но и создавали ощущение тепла, уюта и гармонии.",
  },
  {
    image: "carousel-item-9.webp",
    description:
      "Каждая деталь — от плитки до сантехники — продумана так, чтобы дарить ощущение чистоты и спокойствия. Мы создаём интерьеры, в которых функциональность гармонично сочетается с эстетикой, превращая санузел в настоящий оазис уюта и свежести.",
  },
  {
    image: "carousel-item-10.webp",
    description:
      "Каждый предмет создаёт атмосферу и задаёт ритм жизни в доме. Мы выбираем и создаём мебель с любовью к деталям, сочетая комфорт, функциональность и стиль. Правильная мебель — это не просто вещи, а элементы, которые делают пространство живым и удобным.",
  },
  {
    image: "carousel-item-11.webp",
    description:
      "Каждая штрих — это лёгкое прикосновение, словно ракушка, найденная на берегу, которая оживляет пространство и придаёт ему особое настроение. Тонкие штрихи создают уют, и в окружении таких мелочей ваш дом становится местом, куда хочется возвращаться снова и снова.",
  },
  {
    image: "carousel-item-12.webp",
    description:
      "Каждая штрих — это лёгкое прикосновение, словно ракушка, найденная на берегу, которая оживляет пространство и придаёт ему особое настроение. Тонкие штрихи создают уют, и в окружении таких мелочей ваш дом становится местом, куда хочется возвращаться снова и снова.",
  },
  {
    image: "carousel-item-13.webp",
    description:
      "Каждая штрих — это лёгкое прикосновение, словно ракушка, найденная на берегу, которая оживляет пространство и придаёт ему особое настроение. Тонкие штрихи создают уют, и в окружении таких мелочей ваш дом становится местом, куда хочется возвращаться снова и снова.",
  },
  {
    image: "carousel-item-14.webp",
    description:
      "Каждая штрих — это лёгкое прикосновение, словно ракушка, найденная на берегу, которая оживляет пространство и придаёт ему особое настроение. Тонкие штрихи создают уют, и в окружении таких мелочей ваш дом становится местом, куда хочется возвращаться снова и снова.",
  },
  {
    image: "carousel-item-15.webp",
    description:
      "Каждая штрих — это лёгкое прикосновение, словно ракушка, найденная на берегу, которая оживляет пространство и придаёт ему особое настроение. Тонкие штрихи создают уют, и в окружении таких мелочей ваш дом становится местом, куда хочется возвращаться снова и снова.",
  },
  {
    image: "carousel-item-16.webp",
    description:
      "Каждая штрих — это лёгкое прикосновение, словно ракушка, найденная на берегу, которая оживляет пространство и придаёт ему особое настроение. Тонкие штрихи создают уют, и в окружении таких мелочей ваш дом становится местом, куда хочется возвращаться снова и снова.",
  },
  {
    image: "carousel-item-17.webp",
    description:
      "Каждая штрих — это лёгкое прикосновение, словно ракушка, найденная на берегу, которая оживляет пространство и придаёт ему особое настроение. Тонкие штрихи создают уют, и в окружении таких мелочей ваш дом становится местом, куда хочется возвращаться снова и снова.",
  },
  {
    image: "carousel-item-18.webp",
    description:
      "Каждая штрих — это лёгкое прикосновение, словно ракушка, найденная на берегу, которая оживляет пространство и придаёт ему особое настроение. Тонкие штрихи создают уют, и в окружении таких мелочей ваш дом становится местом, куда хочется возвращаться снова и снова.",
  },
  {
    image: "carousel-item-19.webp",
    description:
      "Каждая штрих — это лёгкое прикосновение, словно ракушка, найденная на берегу, которая оживляет пространство и придаёт ему особое настроение. Тонкие штрихи создают уют, и в окружении таких мелочей ваш дом становится местом, куда хочется возвращаться снова и снова.",
  },
  {
    image: "carousel-item-20.webp",
    description:
      "Каждая штрих — это лёгкое прикосновение, словно ракушка, найденная на берегу, которая оживляет пространство и придаёт ему особое настроение. Тонкие штрихи создают уют, и в окружении таких мелочей ваш дом становится местом, куда хочется возвращаться снова и снова.",
  },
  {
    image: "carousel-item-21.webp",
    description:
      "Каждая штрих — это лёгкое прикосновение, словно ракушка, найденная на берегу, которая оживляет пространство и придаёт ему особое настроение. Тонкие штрихи создают уют, и в окружении таких мелочей ваш дом становится местом, куда хочется возвращаться снова и снова.",
  },
  {
    image: "carousel-item-22.webp",
    description:
      "Каждая штрих — это лёгкое прикосновение, словно ракушка, найденная на берегу, которая оживляет пространство и придаёт ему особое настроение. Тонкие штрихи создают уют, и в окружении таких мелочей ваш дом становится местом, куда хочется возвращаться снова и снова.",
  },
  {
    image: "carousel-item-23.webp",
    description:
      "Каждая штрих — это лёгкое прикосновение, словно ракушка, найденная на берегу, которая оживляет пространство и придаёт ему особое настроение. Тонкие штрихи создают уют, и в окружении таких мелочей ваш дом становится местом, куда хочется возвращаться снова и снова.",
  },
] as const;

export const galleryItems: string[] = [
  "gallery-item-0.webp",
  "gallery-item-1.webp",
  "gallery-item-2.webp",
  "gallery-item-3.webp",
] as const;
